L = [3, 'hello', 7, 4, 'привет', 4, 3, -1] 

print(L[:3]) #подсписок от начала до 3го элемента
print(L[:]) #полная копия списка
print(L[::2]) #Каждый второй элемент списка
print(L[::-1])#перевернутый список
print(L[:-1]) #От начала до предпоследнего элементаpython 
print(L[-1:]) #От предпоследнего элемента до конца списка

"""
[3, 'hello', 7]
[3, 'hello', 7, 4, 'привет', 4, 3, -1]
[3, 7, 'привет', 3]
[-1, 3, 4, 'привет', 4, 7, 'hello', 3]
[3, 'hello', 7, 4, 'привет', 4, 3]
[-1]
"""